s = []
for i in range(1, 21):
    if i % 5 == 0:
        s.append(i)
print(s)

# Генерируем список также как и выше, только в одну строку
s1 = [i for i in range(1, 21) if i % 5 == 0]
print(s1)

# Генерируем список также как и выше, только в одну строку с дополнительным условием в конце
s2 = [i ** 3 for i in range(1, 21) if i % 5 == 0]
print(sum(s2))

# формируем кортежи сперва берется 1е число из 1го диапозона и добавляется 1е число
# из 2го диапозона, затем 1е число из 1го диапозона и добавляется 2е число из 2го диапозона и т.д.
s = []
for i in range(1, 21):
    for j in range(1,51):
        s.append((i, j))
print(s)

# Генерируем список также как выше, только в одну строку
s1 = [(i, j) for i in range(1, 21) for j in range(1,51)]
print(s1)

# Формируем список, если число положительное записываем квадрат этого числа,
# если отрицательное записываем куб этого числа
s = []
for i in range(-10, 11):
    if i > 0:
        s.append(i ** 2)
    else:
        s.append(i ** 3)
print(s)

# Генерируем список также как выше, только в одну строку
s1 = [i ** 2 if i > 0 else i ** 3 for i in range(-10, 11)]
print(s1)

# Генерируем список также как выше, только в одну строку с дополнительным условием в конце
s1 = [i ** 2 if i > 0 else i ** 3 for i in range(-10, 11) if i % 2 == 0]
print(s1)

s = [7, 8, 8, -10, -10]
set_set = {i for i in s} # Генерируем множество
print(set_set)

dictionary = {i: i ** 10 for i in s} # Генерируем словарь
print(dictionary)