# Замыкание

# Замыканием называется такая ситуация когда наша вложенная функция, пользуется переменными которые не объявлены в ее теле
# После того как наша основная функция отработает, переменная name не будет удалена

def main_func(name):
    def inner_func():
        print('hello my friend', name)

    return inner_func


# print(main_func()) # Вызываем главную функцию, в ней есть вложенная функция, результат выполнения главной функции возвращение вложенной функции.


b = main_func('Misha')
c = main_func('Vasya')

b()
c()