def f(a, b):
    print(id(a), id(b), 'local')
    a = 100
    b.append(100) # так как d и c имеют одну и ту же ссылку, это видно по их id, командой добавления в список, изменения происходят в глобальной переменной d
    b[1] = 'hi'
    print(id(a), id(b), 'local after')
    # print(a, b, 'local')


c = 'Hello'
d = [1, 2, 3, 4, 5, 6, 7]

print(id(c), id(d), 'global')

# f(c, d)
f(c, d[:])  # Если передавать копию нашего списка в виде полного среза, тогда в функции в локальном значении изменить ее будет нельзя

print(c, d, 'global')
