# a = {1, 2, 1, 2, 1, 3, 1, 4, 1, 4, 1, 5, 2}
# b = {'hi', 'ha', 'hi', 'ha', 'hi', 'ha', 'ho', 'he'}
# c = set('abracadabra')
# d = set([1,1,1,1,4,2,3,5,5,6,7])
# e = set(range(5))
#
# print(a)
# print(b)
# print(c)
# print(d)
# print(e)

# a1 = (1, 2, 1, 2, 1, 3, 1, 4, 1, 4, 1, 5, 2)
# a1 = set(a1)
# print(a1)
#
# a1 = list(a1)
# print(a1)


# a = {1, 2, 1, 2, 1, 3, 1, 4, 1, 4, 1, 5, 2}
# a.add(9)
# a.update([7, 7, 8, 9, 9, 5, 6])
# a.update('hello ')
# a.update(range(5, 10))
# a.update({5, 1, 3, 5, 56, 67, 78})
#
# a.discard(1)  # Если элемента нет в множестве, программа будет выполнятся дальше
# # a.remove(1) # Если элемента нет в множестве тогда будет ошибка
# print(a)
# a.pop()  # Удаляет случайный элемент из множества
# print(a)
# print(len(a))  # Длинна множества
# print( 4 in a) # True
# print('a' in a) # Falseд
# a.clear()
# print(a)  # Удаляет все элементы из множества

a = {4, 3, 2, 5, 1, 3}
b = {3, 4, 5, 6, 7, 2345}
c = {10, 11, 12}
print(a & c)  # Выводит элементы которые встречаются в обоих множествах
# a &= b # Записываем в переменную a результат пересечения множеств a и b
print(a)
print(a.intersection(b))  # Выводит на экран результат пересечения множеств a и b
# a.intersection_update(b)  # Записывает в переменную a результат пересечения множеств a и b
print(a)
print(a | b, ' - Выводит на экран результат объединения множеств a и b: a | b')
print(a.union(b), ' - Выводит на экран результат объединения множеств a и b: a.union(b)')

a = {1, 2, 3}
b = {4, 5, 6, 7}
# a = a.union(b)  # Объединяет два множества
a |= b  # Объединяет два множества
print(a, ' - Объединеное множество a |= b')

a = {1, 2, 3, 4, 5}
b = {4, 5, 6, 7}
print(a - b, '  a - b')  # Выводим вычтенные элементы множества a мы вычитаем все пересекающиеся элементы множества b
print(b - a, '  b - a')  # Из множества b мы вычитаем все пересекающиеся элементы множества a
b -= a  # Из множества b мы вычитаем все пересекающиеся элементы множества a
print(b, ' - Из множества b мы вычитаем все пересекающиеся элементы множества a: "b -= a" ')

a = {1, 2, 3, 5}
b = {1, 2, 3, 4}
print(a ^ b, ' - Выводит только те значения которые не пересекаются между собой в множествах a и b')

a = {1, 2, 3, 5}
b = {1, 2, 3, 4}
print(a == b)  # False

a = {1, 2, 3, 5, 4, 4, 5}
b = {1, 2, 3, 4, 5, 4, 5, 4}
print(a == b)  # True

a = {1, 2, 3, 5, 4, 4, 5}
b = {1, 2, 3, 5, 4, 4, 5, 4, 7}
print(b - a)  # 7
print(b > a)  # True
print(b < a)  # False

a = {4, 3, 2, 1}
for i in a:
    print(i) # В множестве перебор не работает по индексам, только по значению

text = input()
a = set()
while text != '':
    slova = (text.split())
    a.update(slova) # В множество попадают только уникальный слова
    print(a)
    text = input()
print(len(a))