# Задание:
# Создать текстовый файл (.txt) средствами вашей операционной системы,
# заполнить его любыми цифрами в 1 столбик. Затем написать программу,
# в которой при помощи функции map считать все эти цифры в один список. Затем,
# используя функцию filter, создать новый список, в котором останутся только
# нечетные цифры из предыдущего списка.

with open('nums.txt') as f:
    str = int(f.readline())

    m = map(int, str)
    print(m)


