# Собственные функции

# Создаем собственную функцию, при вызове которой
# будет исполнятся код присвоенной этой функции
def print_spam():
    print('spam')
    print('spam')
    print('spam')

print_spam()
print_spam()

# Создаем собственную функцию которая будет принимать какой либо аргумент
def multiply(number):
    print(number * 2)

# Передаем нашей функции аргумент 5, наша функция принимает аргумент 5
# и подставляет его в параметр функции, исполняя код
# которой мы ей присвоили с переданным аргументом 5
multiply(3)

def max(x,y):
    if x > y:
        return x
    else:
        return y

print(max(11,5))

def max2(x,y):
    if x > y:
        return x
    else:
        return y

x = input('Введите первое число: ')
y = input('Введите второе число: ')

# Переменные x и y не пересекаются с переменными которые относятся
# к собственной функции max2, т.к. они являются локальными для функции max2

print(max2(x,y))