# Срез списков

digits = [1,2,3,4,5,6,7,8,9,10]

# Передаем диапоз из списка, указав от и до
digits2 = digits[2:5]

# Передаем диапоз из списка, указав до
digits3 = digits[:5]

# Передаем диапоз из списка, указав от
digits4 = digits[3:]

# Передаем диапоз из списка, не указываем начало и конец, указываем только шаг
digits5 = digits[::2]

# Передает значение из списка с конца, используя отрицательное значение
# что бы не путаться можно использовать вычет минус 1, для удобство подсчета
digits6 = digits[-2-1]

# Передает значение диапозона с конца списка, но слева направо
digits7 = digits[-4:-1]


# При использовании шага с отрицательным значением, список будет выведен с право на лево
digits8 = digits[::-1][::-1]


print(digits8)

#for i in range(10):
#    print(i)